/**
 *  hobby属性
 */
export const hobby = [
  {'id': '1', 'name': '篮球'},
  {'id': '2', 'name': '足球'},
  {'id': '3', 'name': '排球'},
  {'id': '4', 'name': '皮球'},
];

/**
 *  省、市、区级数据
 */
export const province = [
  {
    'id': '100',
    'name': '北京市',
    'child': [
      {'id': '10000', 'name': '东城区', 'child': ''},
      {'id': '10001', 'name': '西城区', 'child': ''},
      {'id': '10002', 'name': '崇文区', 'child': ''},
      {'id': '10003', 'name': '宣武区', 'child': ''},
      {'id': '10004', 'name': '朝阳区', 'child': ''},
      {'id': '10005', 'name': '海淀区', 'child': ''},
      {'id': '10006', 'name': '丰台区', 'child': ''},
      {'id': '10007', 'name': '石景山区', 'child': ''},
      {'id': '10008', 'name': '房山区', 'child': ''},
      {'id': '10009', 'name': '通州区', 'child': ''},
      {'id': '10010', 'name': '顺义区', 'child': ''},
      {'id': '10011', 'name': '大兴区', 'child': ''},
      {'id': '10012', 'name': '昌平区', 'child': ''},
      {'id': '10013', 'name': '平谷区', 'child': ''},
      {'id': '10014', 'name': '怀柔区', 'child': ''},
      {'id': '10015', 'name': '门头沟区', 'child': ''},
      {'id': '10016', 'name': '密云县', 'child': ''},
      {'id': '10017', 'name': '延庆县', 'child': ''},
    ]
  },
  {
    'id': '101',
    'name': '天津市',
    'child': [
      {'id': '10100', 'name': '和平区', 'child': ''},
      {'id': '10101', 'name': '河东区', 'child': ''},
      {'id': '10102', 'name': '河西区', 'child': ''},
      {'id': '10103', 'name': '南开区', 'child': ''},
      {'id': '10104', 'name': '河北区', 'child': ''},
      {'id': '10105', 'name': '红桥区', 'child': ''},
      {'id': '10106', 'name': '塘沽区', 'child': ''},
      {'id': '10107', 'name': '汉沽区', 'child': ''},
      {'id': '10108', 'name': '大港区', 'child': ''},
      {'id': '10109', 'name': '东丽区', 'child': ''},
      {'id': '10110', 'name': '西青区', 'child': ''},
      {'id': '10111', 'name': '津南区', 'child': ''},
      {'id': '10112', 'name': '北辰区', 'child': ''},
      {'id': '10113', 'name': '武清区', 'child': ''},
      {'id': '10114', 'name': '宝坻区', 'child': ''},
      {'id': '10115', 'name': '蓟县', 'child': ''},
      {'id': '10116', 'name': '宁河县', 'child': ''},
      {'id': '10117', 'name': '静海县', 'child': ''},
    ]
  },
  {
    'id': '102', 'name': '上海市', 'child': [
      {'id': '10200', 'name': '宝山', 'child': ''},
      {'id': '10201', 'name': '崇明', 'child': ''},
      {'id': '10202', 'name': '嘉定', 'child': ''},
      {'id': '10203', 'name': '青浦', 'child': ''},
      {'id': '10204', 'name': '松江', 'child': ''},
      {'id': '10205', 'name': '金山', 'child': ''},
      {'id': '10206', 'name': '奉贤', 'child': ''},
      {'id': '10207', 'name': '闵行', 'child': ''},
      {'id': '10208', 'name': '浦东新区', 'child': ''},
      {'id': '10209', 'name': '普陀', 'child': ''},
      {'id': '10210', 'name': '长宁', 'child': ''},
      {'id': '10211', 'name': '徐汇', 'child': ''},
      {'id': '10212', 'name': '卢湾', 'child': ''},
      {'id': '10213', 'name': '静安', 'child': ''},
      {'id': '10214', 'name': '闸北', 'child': ''},
      {'id': '10215', 'name': '虹口', 'child': ''},
      {'id': '10216', 'name': '黄浦', 'child': ''},
      {'id': '10217', 'name': '杨浦', 'child': ''},
    ]
  },
  {
    'id': '103', 'name': '重庆市', 'child': [
      {'id': '10300', 'name': '万州区', 'child': ''},
      {'id': '10300', 'name': '涪陵区', 'child': ''},
      {'id': '10300', 'name': '渝中区', 'child': ''},
      {'id': '10300', 'name': '大渡口区', 'child': ''},
    ]
  },
  {
    'id': '104', 'name': '河北省', 'child': [
      {
        'id': '10400', 'name': '承德市', 'child': [
          {'id': '1040000', 'name': '围场满族蒙古族自治县'},
          {'id': '1040001', 'name': '丰宁满族自治县'},
          {'id': '1040001', 'name': '隆化县'},
          {'id': '1040001', 'name': '滦平县'},
          {'id': '1040001', 'name': '平泉县'},
          {'id': '1040001', 'name': '承德县'},
          {'id': '1040001', 'name': '宽城满族自治县'},
          {'id': '1040001', 'name': '兴隆县'},
          {'id': '1040001', 'name': '双桥区'},
          {'id': '1040001', 'name': '双滦区'},
          {'id': '1040001', 'name': '鹰手营子矿区'},
        ]
      },
      // {'id': '10401', 'name': '张家口市', 'child': ''},
      // {'id': '10402', 'name': '保定市', 'child': ''},
      // {'id': '10403', 'name': '石家庄市', 'child': ''},
      // {'id': '10404', 'name': '邢台市', 'child': ''},
      // {'id': '10405', 'name': '邯郸市', 'child': ''},
      // {'id': '10406', 'name': '衡水市', 'child': ''},
      // {'id': '10407', 'name': '沧州市', 'child': ''},
      // {'id': '10408', 'name': '廊坊市', 'child': ''},
      // {'id': '10409', 'name': '唐山市', 'child': ''},
      // {'id': '104010', 'name': '秦皇岛市', 'child': ''},
    ]
  },
  // {'id': '105', 'name': '山西省', 'child': ''},
  // {'id': '106', 'name': '陕西省', 'child': ''},
  // {'id': '107', 'name': '山东省', 'child': ''},
  // {'id': '108', 'name': '河南省', 'child': ''},
  // {'id': '109', 'name': '辽宁省', 'child': ''},
  // {'id': '110', 'name': '吉林省', 'child': ''},
  // {'id': '111', 'name': '黑龙江省', 'child': ''},
  // {'id': '112', 'name': '江苏省', 'child': ''},
  // {'id': '113', 'name': '浙江省', 'child': ''},
  // {'id': '114', 'name': '安徽省', 'child': ''},
  // {'id': '115', 'name': '江西省', 'child': ''},
  // {'id': '116', 'name': '福建省', 'child': ''},
  // {'id': '117', 'name': '湖北省', 'child': ''},
  // {'id': '118', 'name': '湖南省', 'child': ''},
  // {'id': '119', 'name': '四川省', 'child': ''},
  // {'id': '120', 'name': '贵州省', 'child': ''},
  // {'id': '121', 'name': '云南省', 'child': ''},
  // {'id': '122', 'name': '广东省', 'child': ''},
  // {'id': '123', 'name': '海南省', 'child': ''},
  // {'id': '124', 'name': '甘肃省', 'child': ''},
  // {'id': '125', 'name': '青海省', 'child': ''},
  // {'id': '126', 'name': '内蒙古自治区', 'child': ''},
  // {'id': '127', 'name': '新疆维吾尔自治区', 'child': ''},
  // {'id': '128', 'name': '西藏自治区', 'child': ''},
  // {'id': '129', 'name': '广西壮族自治区', 'child': ''},
  // {'id': '130', 'name': '宁夏回族自治区', 'child': ''},
];
