/*后台管理-全局菜单*/
export const menus = [
  {
    text: '用户管理',
    iconCls: 'fa fa-user-o',
    state: 'open',
    children: [{
      text: '用户信息',
      link: 'user'
      // children: [{
      //   text: '基本信息',
      //   selected: true,
      //   link: 'user'
      // }]
    }]
  }, {
    text: '图片管理',
    iconCls: 'fa fa-file-picture-o',
    children: [{
      text: '图片分类',
      link: 'coverType',
    }, {
      text: '图片信息',
      link: 'cover',
    }]
  }, {
    text: '商品管理',
    iconCls: 'fa fa-shopping-bag',
    children: [{
      text: '商品分类',
      link: 'goodsType',
    }, {
      text: '商品信息',
      link: 'goods',
    }]
  }, {
    text: '销售管理',
    iconCls: 'fa fa-pie-chart',
    children: [{
      text: '销售信息'
    }, {
      text: '销售统计'
    }]
  }, {
    text: '系统管理',
    iconCls: 'fa fa-print',
    children: [{
      text: '日志',
      link: 'log',
    },
      {
        text: '验证码',
        link: 'emailCode',
      }]
  }];

/*用户模块: hobby*/
export const hobby = [
  {'id': '1', 'name': '篮球'},
  {'id': '2', 'name': '足球'},
  {'id': '3', 'name': '排球'},
  {'id': '4', 'name': '皮球'},
];

/*用户模块: province*/
export const province = [
  {
    'id': '100',
    'name': '北京市',
    'child': [
      {'id': '10000', 'name': '东城区', 'child': null},
      {'id': '10001', 'name': '西城区', 'child': null},
      {'id': '10002', 'name': '崇文区', 'child': null},
      {'id': '10003', 'name': '宣武区', 'child': null},
      {'id': '10004', 'name': '朝阳区', 'child': null},
      {'id': '10005', 'name': '海淀区', 'child': null},
      {'id': '10006', 'name': '丰台区', 'child': null},
      {'id': '10007', 'name': '石景山区', 'child': null},
      {'id': '10008', 'name': '房山区', 'child': null},
      {'id': '10009', 'name': '通州区', 'child': null},
      {'id': '10010', 'name': '顺义区', 'child': null},
      {'id': '10011', 'name': '大兴区', 'child': null},
      {'id': '10012', 'name': '昌平区', 'child': null},
      {'id': '10013', 'name': '平谷区', 'child': null},
      {'id': '10014', 'name': '怀柔区', 'child': null},
      {'id': '10015', 'name': '门头沟区', 'child': null},
      {'id': '10016', 'name': '密云县', 'child': null},
      {'id': '10017', 'name': '延庆县', 'child': null},
    ]
  },
  {
    'id': '101',
    'name': '天津市',
    'child': [
      {'id': '10100', 'name': '和平区', 'child': null},
      {'id': '10101', 'name': '河东区', 'child': null},
      {'id': '10102', 'name': '河西区', 'child': null},
      {'id': '10103', 'name': '南开区', 'child': null},
      {'id': '10104', 'name': '河北区', 'child': null},
      {'id': '10105', 'name': '红桥区', 'child': null},
      {'id': '10106', 'name': '塘沽区', 'child': null},
      {'id': '10107', 'name': '汉沽区', 'child': null},
      {'id': '10108', 'name': '大港区', 'child': null},
      {'id': '10109', 'name': '东丽区', 'child': null},
      {'id': '10110', 'name': '西青区', 'child': null},
      {'id': '10111', 'name': '津南区', 'child': null},
      {'id': '10112', 'name': '北辰区', 'child': null},
      {'id': '10113', 'name': '武清区', 'child': null},
      {'id': '10114', 'name': '宝坻区', 'child': null},
      {'id': '10115', 'name': '蓟县', 'child': null},
      {'id': '10116', 'name': '宁河县', 'child': null},
      {'id': '10117', 'name': '静海县', 'child': null},
    ]
  },
  {
    'id': '102', 'name': '上海市', 'child': [
      {'id': '10200', 'name': '宝山', 'child': null},
      {'id': '10201', 'name': '崇明', 'child': null},
      {'id': '10202', 'name': '嘉定', 'child': null},
      {'id': '10203', 'name': '青浦', 'child': null},
      {'id': '10204', 'name': '松江', 'child': null},
      {'id': '10205', 'name': '金山', 'child': null},
      {'id': '10206', 'name': '奉贤', 'child': null},
      {'id': '10207', 'name': '闵行', 'child': null},
      {'id': '10208', 'name': '浦东新区', 'child': null},
      {'id': '10209', 'name': '普陀', 'child': null},
      {'id': '10210', 'name': '长宁', 'child': null},
      {'id': '10211', 'name': '徐汇', 'child': null},
      {'id': '10212', 'name': '卢湾', 'child': null},
      {'id': '10213', 'name': '静安', 'child': null},
      {'id': '10214', 'name': '闸北', 'child': null},
      {'id': '10215', 'name': '虹口', 'child': null},
      {'id': '10216', 'name': '黄浦', 'child': null},
      {'id': '10217', 'name': '杨浦', 'child': null},
    ]
  },
  {
    'id': '103', 'name': '重庆市', 'child': [
      {'id': '10300', 'name': '万州区', 'child': null},
      {'id': '10300', 'name': '涪陵区', 'child': null},
      {'id': '10300', 'name': '渝中区', 'child': null},
      {'id': '10300', 'name': '大渡口区', 'child': null},
    ]
  },
  {
    'id': '104', 'name': '河北省', 'child': [
      {
        'id': '10400', 'name': '承德市', 'child': [
          {'id': '1040000', 'name': '围场满族蒙古族自治县'},
          {'id': '1040001', 'name': '丰宁满族自治县'},
          {'id': '1040002', 'name': '隆化县'},
          {'id': '1040003', 'name': '滦平县'},
          {'id': '1040004', 'name': '平泉县'},
          {'id': '1040005', 'name': '承德县'},
          {'id': '1040006', 'name': '宽城满族自治县'},
          {'id': '1040007', 'name': '兴隆县'},
          {'id': '1040008', 'name': '双桥区'},
          {'id': '1040009', 'name': '双滦区'},
          {'id': '1040010', 'name': '鹰手营子矿区'},
        ]
      },
      {
        'id': '10401', 'name': '张家口市', 'child': [
          {'id': '1040100', 'name': '桥西区'},
          {'id': '1040101', 'name': '桥东区'},
          {'id': '1040102', 'name': '阳原县'},
          {'id': '1040103', 'name': '下花园区'},
          {'id': '1040104', 'name': '宣化县'},
          {'id': '1040105', 'name': '张北县'},
          {'id': '1040106', 'name': '康保县'},
          {'id': '1040107', 'name': '沽源县'},
          {'id': '1040108', 'name': '尚义县'},
          {'id': '1040109', 'name': '蔚县'},
          {'id': '1040110', 'name': '宣化区'},
          {'id': '1040111', 'name': '怀安县'},
          {'id': '1040112', 'name': '万全县'},
          {'id': '1040113', 'name': '怀来县'},
          {'id': '1040114', 'name': '涿鹿县'},
          {'id': '1040115', 'name': '赤城县'},
          {'id': '1040116', 'name': '崇礼县'},
        ]
      },
      {
        'id': '10402', 'name': '保定市', 'child': [
          {'id': '1040200', 'name': '定州市'},
          {'id': '1040201', 'name': '涿州市'},
          {'id': '1040202', 'name': '安国市'},
          {'id': '1040203', 'name': '高碑店市'},
          {'id': '1040204', 'name': '易县'},
          {'id': '1040205', 'name': '徐水县'},
          {'id': '1040206', 'name': '涞源县'},
          {'id': '1040207', 'name': '定兴县'},
          {'id': '1040208', 'name': '顺平县'},
          {'id': '1040209', 'name': '唐县'},
          {'id': '1040210', 'name': '望都县'},
          {'id': '1040211', 'name': '涞水县'},
          {'id': '1040212', 'name': '清苑县'},
          {'id': '1040213', 'name': '满城县'},
          {'id': '1040214', 'name': '高阳县'},
          {'id': '1040215', 'name': '安新县'},
          {'id': '1040216', 'name': '雄县'},
          {'id': '1040217', 'name': '容城县'},
          {'id': '1040218', 'name': '曲阳县'},
          {'id': '1040219', 'name': '阜平县'},
          {'id': '1040220', 'name': '博野县'},
          {'id': '1040221', 'name': '蠡县'},
        ]
      },
      {
        'id': '10403', 'name': '石家庄市', 'child': [
          {'id': '1040300', 'name': '新华区'},
          {'id': '1040301', 'name': '桥西区'},
          {'id': '1040302', 'name': '桥东区'},
          {'id': '1040303', 'name': '长安区'},
          {'id': '1040304', 'name': '裕华区'},
          {'id': '1040305', 'name': '矿区'},
          {'id': '1040306', 'name': '辛集市'},
          {'id': '1040307', 'name': '晋州市'},
          {'id': '1040308', 'name': '藁城市'},
          {'id': '1040309', 'name': '新乐市'},
          {'id': '1040310', 'name': '鹿泉市'},
          {'id': '1040311', 'name': '正定县'},
          {'id': '1040312', 'name': '深泽县'},
          {'id': '1040313', 'name': '无极县'},
          {'id': '1040314', 'name': '赵县'},
          {'id': '1040315', 'name': '栾城县'},
          {'id': '1040316', 'name': '高邑县'},
          {'id': '1040317', 'name': '元氏县'},
          {'id': '1040318', 'name': '赞皇县'},
          {'id': '1040319', 'name': '井陉县'},
          {'id': '1040320', 'name': '平山县'},
          {'id': '1040321', 'name': '灵寿县'},
          {'id': '1040321', 'name': '行唐县'},
        ]
      },
      {
        'id': '10404', 'name': '邢台市', 'child': [
          {'id': '1040400', 'name': '沙河市'},
          {'id': '1040401', 'name': '南宫市'},
          {'id': '1040402', 'name': '清河市'},
          {'id': '1040403', 'name': '宁晋县'},
          {'id': '1040404', 'name': '内丘县'},
          {'id': '1040405', 'name': '广宗县'},
          {'id': '1040406', 'name': '邢台县'},
          {'id': '1040407', 'name': '任县'},
          {'id': '1040408', 'name': '临西县'},
          {'id': '1040409', 'name': '新河县'},
          {'id': '1040410', 'name': '隆尧县'},
          {'id': '1040411', 'name': '柏乡县'},
          {'id': '1040412', 'name': '威县'},
          {'id': '1040413', 'name': '临城县'},
          {'id': '1040414', 'name': '平乡县'},
          {'id': '1040415', 'name': '南和县'},
          {'id': '1040416', 'name': '巨鹿县'},
        ]
      },
      {
        'id': '10405', 'name': '邯郸市', 'child': [
          {'id': '1040500', 'name': '丛台区'},
          {'id': '1040501', 'name': '复兴区'},
          {'id': '1040502', 'name': '邯山区'},
          {'id': '1040503', 'name': '峰峰矿区'},
          {'id': '1040504', 'name': '武安市'},
          {'id': '1040505', 'name': '鸡泽县'},
          {'id': '1040506', 'name': '邱县'},
          {'id': '1040507', 'name': '永年县'},
          {'id': '1040508', 'name': '曲周县'},
          {'id': '1040509', 'name': '邯郸县'},
          {'id': '1040510', 'name': '肥乡县'},
          {'id': '1040511', 'name': '馆陶县'},
          {'id': '1040512', 'name': '涉县'},
          {'id': '1040513', 'name': '广平县'},
          {'id': '1040514', 'name': '成安县'},
          {'id': '1040515', 'name': '魏县'},
          {'id': '1040516', 'name': '磁县'},
          {'id': '1040517', 'name': '临漳县'},
          {'id': '1040518', 'name': '大名县'},
        ]
      },
      {
        'id': '10406', 'name': '衡水市', 'child': [
          {'id': '1040600', 'name': '桃城区'},
          {'id': '1040601', 'name': '开发区'},
          {'id': '1040602', 'name': '滨湖新区'},
          {'id': '1040603', 'name': '深州市'},
          {'id': '1040604', 'name': '冀州市'},
          {'id': '1040605', 'name': '景县'},
          {'id': '1040606', 'name': '故城县'},
          {'id': '1040607', 'name': '枣强县'},
          {'id': '1040608', 'name': '武邑县'},
          {'id': '1040609', 'name': '安平县'},
          {'id': '1040610', 'name': '武强县'},
          {'id': '1040611', 'name': '阜城县'},
          {'id': '1040612', 'name': '饶阳县'}
        ]
      },
      {
        'id': '10407', 'name': '沧州市', 'child': [
          {'id': '1040700', 'name': '新华区'},
          {'id': '1040701', 'name': '运河区'},
          {'id': '1040702', 'name': '开发区'},
          {'id': '1040703', 'name': '辖泊头市'},
          {'id': '1040704', 'name': '任丘市'},
          {'id': '1040705', 'name': '黄骅市'},
          {'id': '1040706', 'name': '河间市'},
          {'id': '1040707', 'name': '沧县'},
          {'id': '1040708', 'name': '青县'},
          {'id': '1040709', 'name': '东光县'},
          {'id': '1040710', 'name': '海兴县'},
          {'id': '1040711', 'name': '盐山县'},
          {'id': '1040712', 'name': '肃宁县'},
          {'id': '1040713', 'name': '南皮县'},
          {'id': '1040714', 'name': '吴桥县'},
          {'id': '1040715', 'name': '献县和孟村回族自治县'}

        ]
      },
      {'id': '10408', 'name': '廊坊市', 'child': null},
      {'id': '10409', 'name': '唐山市', 'child': null},
      {'id': '104010', 'name': '秦皇岛市', 'child': null},
    ]
  },
  // {'id': '105', 'name': '山西省', 'child': null},
  // {'id': '106', 'name': '陕西省', 'child': null},
  // {'id': '107', 'name': '山东省', 'child': null},
  // {'id': '108', 'name': '河南省', 'child': null},
  // {'id': '109', 'name': '辽宁省', 'child': null},
  // {'id': '110', 'name': '吉林省', 'child': null},
  // {'id': '111', 'name': '黑龙江省', 'child': null},
  // {'id': '112', 'name': '江苏省', 'child': null},
  // {'id': '113', 'name': '浙江省', 'child': null},
  // {'id': '114', 'name': '安徽省', 'child': null},
  // {'id': '115', 'name': '江西省', 'child': null},
  // {'id': '116', 'name': '福建省', 'child': null},
  // {'id': '117', 'name': '湖北省', 'child': null},
  // {'id': '118', 'name': '湖南省', 'child': null},
  // {'id': '119', 'name': '四川省', 'child': null},
  // {'id': '120', 'name': '贵州省', 'child': null},
  // {'id': '121', 'name': '云南省', 'child': null},
  // {'id': '122', 'name': '广东省', 'child': null},
  // {'id': '123', 'name': '海南省', 'child': null},
  // {'id': '124', 'name': '甘肃省', 'child': null},
  // {'id': '125', 'name': '青海省', 'child': null},
  // {'id': '126', 'name': '内蒙古自治区', 'child': null},
  // {'id': '127', 'name': '新疆维吾尔自治区', 'child': null},
  // {'id': '128', 'name': '西藏自治区', 'child': null},
  // {'id': '129', 'name': '广西壮族自治区', 'child': null},
  // {'id': '130', 'name': '宁夏回族自治区', 'child': null},
];
